biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        auctions = Auction.order(created_at: :desc)

INSERT INTO "auctions" ("title", "description", "ends_at", "reserve_price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        auction = Auction.new auction_params
        auction.user = current_user
         auction.save!

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def auction
        @auction ||= Auction.find params[:id]