biddr_api/app/controllers/bids_controller.rb

    def create
        bid = Bid.new bid_params
        bid.user = current_user
        bid.auction = params[:auction_id]
         bid.save!
---
INSERT INTO "bids" ("price", "auction_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 1000], ["auction_id", 9], ["user_id", 1], ["created_at", "2019-02-12 20:03:28.567500"], ["updated_at", "2019-02-12 20:03:28.567500"]]